{
  "id": "about",
  "schemaId": "html",
  "data": {
    "content": "<h1>Hello!</h1><p>I’m <strong>Manuel Maiuolo</strong>, Italian MSc student in Artificial Intelligence at <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-blue-600 underline hover:text-blue-800\" href=\"https://polimi.it/\">Politecnico di Milano</a>.</p><p>I’m passionate about technology, programming, solving problems and contributing to impactful projects.</p><p>My journey started with curiosity for how things work: from puzzles and logic games to writing my first lines of code in high school.</p><p>Today, that same curiosity drives me to design intelligent systems and craft interactive experiences.</p><p>I believe technology should feel alive: responsive, creative, and meaningful.</p><p>That philosophy guides my projects, from <strong>DAIM Adventure Engine</strong>, an AI Dungeon Master that shapes living RPG worlds, to <strong>SHolo</strong>, where you can manipulate holograms with your hands on your desktop!</p><p>After graduating in Computer Science and Engineering with 110/110, I wasn’t sure whether to start working as a SWE or keep studying, but after an inspiring conversation with a very cool hiring manager I realized that pursuing a master’s would be the right path.</p><p>I’ve always loved <strong>learning new things</strong> and turning them into personal projects. That’s why I started my MSc in Artificial Intelligence: a natural continuation of my CS degree, and the perfect way to gain the skills I need to bring even more ambitious ideas to life.</p><p>Beyond AI, I founded <strong>BestPlayers Company</strong>, releasing my first indie game <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-blue-600 underline hover:text-blue-800\" href=\"https://play.google.com/store/apps/details?id=com.bestplayerscompany.pin\">Pin</a> on the Play Store, and joined <strong>Bending Spoons’ First Commit</strong> challenge, where I worked hands-on in a simulated production environment with real-world constraints.</p><p>Want to know more about me? Explore the <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-blue-600 underline hover:text-blue-800\" href=\"https://portfolio.bestplayer.dev/post/fun-facts\">fun facts</a> section!</p><h2>Enjoy my Portfolio!</h2><p>For the best experience, visit from a desktop: you’ll be able to interact with the 3D environment.</p><p>In any case, you can navigate in the classical view (this one) to explore all the available sections: start from <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-blue-600 underline hover:text-blue-800\" href=\"https://portfolio.bestplayer.dev/post/project\">my projects</a>!</p><p>Thanks for stopping by, I hope you enjoy exploring it :)</p>"
  },
  "metadata": {
    "createdAt": "2025-10-21T11:03:12.707Z",
    "updatedAt": "2025-11-08T20:36:04.371Z",
    "author": "Manuel Maiuolo",
    "status": "published",
    "id": "about",
    "publishedAt": "2025-10-21T11:04:19.148Z"
  }
}