{
  "id": "about",
  "schemaId": "html",
  "data": {
    "content": "<h2>Hello!</h2><p>I’m <strong>Manuel Maiuolo</strong>, Italian MSc student in Artificial Intelligence at <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-blue-600 underline hover:text-blue-800\" href=\"https://polimi.it/\">Politecnico di Milano</a>, after graduating in Computer Science and Engineering with 110/110.</p><p>I’m passionate about technology, programming, solving problems and contributing to impactful projects.</p><p>My journey started with curiosity for how things work: from puzzles and logic games to writing my first lines of code in high school.</p><p>Today, that same curiosity drives me to design intelligent systems, explore AI applications and craft interactive experiences.</p><p>I believe technology should feel alive: responsive, creative, and meaningful.</p><p>That philosophy guides my projects, from <strong>DAIM Adventure Engine</strong>, an AI Dungeon Master that shapes living RPG worlds, to <strong>Magic Portfolio</strong>, a 3D showcase where every element embodies part of who I am.</p><p>Beyond AI, I founded <strong>BestPlayers Company</strong>, releasing my first indie game <em>Pin</em> on the Play Store, and joined <strong>Bending Spoons’ First Commit</strong> challenge, where I worked hands-on in a simulated production environment with real-world constraints.</p><p>I love to learn, to build, and to collaborate, always chasing that balance between technical precision and creative spark.</p><h2>Enjoy my Portfolio!</h2><p>For the best experience, visit from a desktop: you’ll be able to interact with the 3D environment.</p><p>In any case, you can navigate in the classical view (this one) to explore all the available sections: start from <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-blue-600 underline hover:text-blue-800\" href=\"https://portfolio.bestplayer.dev/post/project\">my projects</a>!</p><p>Thanks for stopping by, I hope you enjoy exploring it :)</p>"
  },
  "metadata": {
    "createdAt": "2025-10-21T11:03:12.707Z",
    "updatedAt": "2025-11-07T23:53:38.122Z",
    "author": "Manuel Maiuolo",
    "status": "published",
    "id": "about",
    "publishedAt": "2025-10-21T11:04:19.148Z"
  }
}