{
  "id": "fun-facts",
  "schemaId": "fun-facts",
  "data": {
    "fun-facts": [
      {
        "content": "Harry Potter was the gateway. Now I devour the heavy tomes of Westeros and Middle-earth: a lifelong addiction to ink, dragons, and complex plots.",
        "category": "personal"
      },
      {
        "content": "I played piano for 4 years and clarinet for 2. But my musical skills are now... \"vintage\"",
        "category": "personal"
      },
      {
        "content": "I’ve competed in problem-solving competitions and ranked 4th in all of Lombardy. Basically, I like thinking outside the box… sometimes so far out it’s questionable.",
        "category": "technical"
      },
      {
        "content": "I wasn’t always sure I’d end up in computer engineering. A year before choosing that field @PoliMi, I dreamed of working in a chemistry lab, mixing chemicals and discovering the next big reaction.",
        "category": "personal"
      },
      {
        "content": "I owe my creativity to supportive teachers and a very permissive mom. Once, at 16, I was experimenting at home and turned copper sulfate and sodium bicarbonate into (what I hope was) copper carbonate.",
        "category": "random"
      },
      {
        "content": "My sports résumé is diverse: swimming at 4, then switched to football at 8 for five years, then rugby for another four. Basically, I spent my childhood and teenage years in water, on grass, or being tackled.",
        "category": "personal"
      },
      {
        "content": "My favorite TV series? The first seven seasons of Game of Thrones...",
        "category": "random"
      },
      {
        "content": "I enjoy video games of all kinds, but Skyrim holds a special place in my heart.",
        "category": "personal"
      },
      {
        "content": "I eat pretty much everything, but my ultimate favorite meal exists in a sort of quantum superposition: sometimes it collapses to pizza, sometimes to sushi.",
        "category": "personal"
      },
      {
        "content": "As a kid, I tried my hand at magic tricks with cards. Spoiler: I’m still better at coding than making rabbits appear out of hats.",
        "category": "personal"
      },
      {
        "content": "My curiosity for programming beyond the C++ I learned in high school started on lazy Sunday afternoons. I couldn’t find the perfect game on Google Play, so I decided to try building it myself. That led me to learn Unity and eventually create one of my projects (Pin). The game I imagined is still only in my head, but the journey has been half the fun.",
        "category": "technical"
      },
      {
        "content": "I have BLS-D Certification, including AED usage training. Basically, I can code and potentially save a life (hopefully the person is in danger for reasons other than my code)",
        "category": "personal"
      },
      {
        "content": "I guided museum tours at the 'Collegiate' Museum, explaining art and history to visitors.",
        "category": "technical"
      },
      {
        "content": "I organized and ran educational and recreational activities for children aged 11-13: I learned that creativity + patience = controlled chaos.",
        "category": "personal"
      },
      {
        "content": "I enjoy solving LeetCode challenges and sometimes I even manage to submit the fastest solution. Yes, I quietly celebrate those small victories",
        "category": "technical"
      }
    ]
  },
  "metadata": {
    "id": "fun-facts",
    "createdAt": "2025-10-29T23:23:21.048Z",
    "updatedAt": "2025-12-06T11:30:32.688Z",
    "status": "published",
    "publishedAt": "2025-10-30T00:19:30.825Z"
  }
}